from librarian.discord.languages import base


class Russian(base.Language):
    code = "ru"
    highlights = [
        "a new wiki article is just a click away:",
        u"время исправлять чужие ошибки:",
        u"вышла новая книга Владимира Сорокина:",
        u"на GitHub опять что-то перевели:",
        u"хороших выходных:",
        u"объясняем на карточках вместе с Медузой:",
        u"вот ещё кое-что:",
        u"пожалуйста, взгляните:",
        u"доставайте красные карандаши:",
        u"если некуда девать свободное время:",
        u"новый пулл-реквест на небосклоне:",
        u"у нас на один перевод больше:",
        u"произошло что-то интересное:",
        u"у вас одно новое сообщение:",
        u"перевод? перевод!",
        u"вам письмо от неанонимного доброжелателя:",
        u"здесь могла быть ваша реклама:",
        u"нужна помощь:",
        '`wiki.by_language("russian").inflight_translations += 1`',
    ]
